easy-gnupg-talk/easy-gnupg.org
#+TITLE:     Easy GnuPG
#+AUTHOR:    Dashamir Hoxha
#+EMAIL:     dashohoxha@gmail.com
#+OPTIONS:   H:3 num:nil toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+OPTIONS:   TeX:nil LaTeX:nil skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+OPTIONS:   org_reveal_title_slide:<h1 class="title">Easy GnuPG</h1>
#+OPTIONS:   reveal_title_slide:nil
# #+REVEAL_ROOT: http://cdn.jsdelivr.net/reveal.js/3.0.0/
#+REVEAL_HLEVEL: 1
#+REVEAL-SLIDE-NUMBER: t
#+REVEAL_THEME: serif
#+REVEAL_TRANS: linear

* FOSDEM 2018

#+begin_export html
<h1 class="title">Easy GnuPG</h1>
<h2 class="author">Dashamir Hoxha</h2>
<h3 class="email">dashohoxha@gmail.com</h3>
<h4>https://github.com/dashohoxha/egpg</h4>
#+end_export


* What is GnuPG

  + *GnuPG (GNU Privacy Guard)* is a complete and free implementation of
    the *OpenPGP* standard. It allows you to encrypt and sign your data
    and communications.

  + *GnuPG* has _scads of options_ which make it a _flexible_ and _powerful_
    encryption framework. However this also makes it _extremely
    complicated_ to get started with, and that quite reasonably puts
    people off.

** GnuPG is difficult

  + I have tried to use GnuPG since a long time ago, spent a lot of
    time reading detailed and complicated tutorials, manuals etc. and
    still I find myself lost when trying to use GnuPG.


** Problems with GnuPG (in my opinion)

  + The *gpg* command is monolithic, bloated with functionality and options.
  + The docs are not clearly structured.
  + The number of commands and options is huge.
  + There is no clear distinction between the commands and the options.
  + The supported use cases are not so clear (it tries to support everything).
  + The terminology is a bit confusing and counter-intuitive.

* What is EasyGnuPG

  + *EasyGnuPG* is a _wrapper script_ that aims to _simplify_ the process of
    using GnuPG.
  + The more people using strong encryption, the better for everyone.

** What is EasyGnuPG

  + It tries to offer:
    - a simpler interface
    - with much less commands and options
    - better organized and structured
    - with a more intuitive terminology
    - with a modular construction
    - that is also easy to customize, adapt and extend


* EasyGnuPG is opinionated

  + In order to simplify things, *EasyGnuPG* is opinionated about the
    "right" way to use GnuPG. This means that while *GPG* offers lots of
    options and flexibility to perform a certain task, *EGPG* uses just
    a sensible default way, in order to keep things simple and not to
    bewilder the user with countless choices.

** EasyGnuPG is opinionated

  + For example, when you create a new key in GPG you have to specify
    a lot of options, most of which make no sense for a beginner, so
    they will just use the defaults anyway.
  + EGPG on the other hand, just asks for a name and an email address,
    filling up the rest with reasonable default values.
  + Not only that, but it also goes on and generates automatically the
    needed subkeys, according to well known recommendations and best
    practices of using GPG.

** EasyGnuPG is opinionated

  + Or, when encrypting a file, it also automatically signs it,
    encrypts it to the author as well, and generates the output in the
    text format (ASCII armored), which is more universal than the
    binary format.

** EasyGnuPG is opinionated

  + This simplicity makes it easier for the beginners to get started.
  + At the same time, the selected subset of operations and features
    covers most of the common cases of usage, so hopefully it should
    be sufficient for the everyday needs of most of the users.


* EGPG integrates seamlessly with GPG

  + In case users need to use some advanced features or commands which
    are not supported by EGPG, they can go on and use GPG itself at
    any time, because EGPG also integrates seamlessly with GPG.
  + So, the reduced set of supported operations and features, while
    being convenient for everyday usage, does not limit or prevent
    users for doing more advanced or complex things.

** EGPG integrates seamlessly with GPG

  + For example, if you want to do some extra editing to the key,
    which can't be done with EGPG due to its limited set of
    functionality, you can do it like this:
    #+begin_example
    egpg gpg --edit-key 562AC309C01D2DBD
    #+end_example
    Running =gpg= as a subcommand of =egpg= will ensure
    that it uses the same environment (=GNUPGHOME=) as =egpg=.

** EGPG integrates seamlessly with GPG

  + Also, when initiating a new EGPG environment (with =egpg init=), you
    can migrate all the data from an existing GPG or EGPG environment
    (with =egpg migrate=).
  + Or you can fetch (pick up) only certain keys or contacts (public keys).
  + For example:
    #+begin_example
    egpg key fetch -k 01D532A283DC1CBF
    egpg contact fetch 01D532A283DC1CBF
    #+end_example


* EGPG has a clear and intuitive terminology

  + One of the things that confuses people while using GPG is the
    overloaded and unclear terminology about keys, about signatures,
    etc.
  + EGPG tries to improve this by making a clear distinction between
    the private keys and the public keys.

** EGPG has a clear and intuitive terminology

  + In EGPG there is only one primary *key*, which is used for
    signing, and a subkey which is used for decryption.
  + All the public keys are called *contacts*, since they contain the
    names and email addresses of the people that you use to
    communicate (either send them encrypted messages or verify their
    signatures).

** EGPG has a clear and intuitive terminology

  + If you say *public key* to a beginner, you will also have to
    explain to him some cryptographic details and how public keys
    should be used.
  + But if you say *contact* everybody gets that it contains details
    that enable and facilitate communication.
  + Also, it makes more sense when you certify and trust a contact,
    rather than editing a key and changing its certification and trust
    levels.


* EGPG is transparent and auditable

  + Being built as a set of shell scripts, EGPG is quite transparent
    and auditable (different from a GUI for example, or a web
    service).
  + If you are concerned about what it does, open up the files and
    read them, or have someone you trust read them.

** EGPG is transparent and auditable

  + The size of the main script is less than 250 lines, well within
    the reach of most of the users.
  + Most of the commands are implemented on their own script, and
    these scripts are about 50 lines long on average.


* EGPG commands

  + The set of commands and options of EGPG is well structured and
    intuitive.  There are commands for:
    - working with files (for signing and encryption)
    - managing the key
    - managing contacts
    - other extra commands

