easy-gnupg/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-02-03 Sat 17:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Easy GnuPG</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Dashamir Hoxha" />
<link rel="stylesheet" type="text/css" href="org-info.css" />


</head>
<body>
<div id="content">
<h1 class="title">Easy GnuPG</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org61f24aa">What is GnuPG</a></li>
<li><a href="#org638bc9d">What is EasyGnuPG</a></li>
<li><a href="#org5b41220">EasyGnuPG is opinionated</a></li>
<li><a href="#org6b300bb">EGPG integrates seamlessly with GPG</a></li>
<li><a href="#orgddda527">EGPG has a clear and intuitive terminology</a></li>
<li><a href="#org70cd81b">EGPG is transparent and auditable</a></li>
<li><a href="#org0b019e6">EGPG commands</a></li>
<li><a href="#orgb8feb3c">Managing the keys</a></li>
<li><a href="#orge4031cc">EGPG extends the features of GPG</a></li>
<li><a href="#orgec3dfed">Splitting the key</a></li>
<li><a href="#org59cf601">EGPG can work on any platform</a></li>
<li><a href="#org99f0ccb">EGPG is customizable and extensible</a></li>
<li><a href="#orgefd5e15">EGPG enables scripting</a></li>
<li><a href="#orgcb61e78">EGPG criticism</a></li>
<li><a href="#org59d14a4">EGPG improvements</a></li>
</ul>
</div>
</div>

<div id="outline-container-org61f24aa" class="outline-2">
<h2 id="org61f24aa">What is GnuPG</h2>
<div class="outline-text-2" id="text-org61f24aa">
<p>
<b>GnuPG (GNU Privacy Guard)</b> is a complete and free implementation of the
<b>OpenPGP</b> standard. It allows you to encrypt and sign your data and
communications.
</p>

<p>
<b>GnuPG</b> has <span class="underline">scads of options</span> which make it a <span class="underline">flexible</span> and <span class="underline">powerful</span>
encryption framework. However this also makes it <span class="underline">extremely complicated</span>
to get started with, and that quite reasonably puts people off.
</p>

<p>
I have tried to use GnuPG since a long time ago, spent a lot of time
reading detailed and complicated tutorials, manuals etc. and still I
find myself lost when trying to use GnuPG.
</p>

<p>
Some of the problems with GnuPG (in my opinion) are these:
</p>
<ul class="org-ul">
<li>The <b>gpg</b> command is monolithic, bloated with functionality and options.</li>
<li>The docs are not clearly structured.</li>
<li>The number of commands and options is huge.</li>
<li>There is no clear distinction between the commands and the options.</li>
<li>The supported use cases are not so clear (it tries to support everything).</li>
<li>The terminology is a bit confusing and counter-intuitive.</li>
</ul>
</div>
</div>

<div id="outline-container-org638bc9d" class="outline-2">
<h2 id="org638bc9d">What is EasyGnuPG</h2>
<div class="outline-text-2" id="text-org638bc9d">
<p>
<b>EasyGnuPG</b> is a <span class="underline">wrapper script</span> that aims to <span class="underline">simplify</span> the process of
using GnuPG. It tries to offer:
</p>
<ul class="org-ul">
<li>a simpler interface</li>
<li>with much less commands and options</li>
<li>better organized and structured</li>
<li>with a more intuitive terminology</li>
<li>with a modular construction</li>
<li>that is also easy to customize, adapt and extend</li>
</ul>
</div>
</div>


<div id="outline-container-org5b41220" class="outline-2">
<h2 id="org5b41220">EasyGnuPG is opinionated</h2>
<div class="outline-text-2" id="text-org5b41220">
<p>
In order to simplify things, <b>EasyGnuPG</b> is opinionated about the
"right" way to use GnuPG. This means that while <b>GPG</b> offers lots of
options and flexibility to perform a certain task, <b>EGPG</b> uses just a
sensible default way, in order to keep things simple and not to
bewilder the user with countless choices.
</p>

<p>
For example, when you create a new key in GPG you have to specify a
lot of options, most of which make no sense for a beginner, so they
will just use the defaults anyway. EGPG on the other hand, just asks
for a name and an email address, filling up the rest with reasonable
default values. Not only that, but it also goes on and generates
automatically the needed subkeys, according to well known
recommendations and best practices of using GPG.
</p>

<p>
Or, when encrypting a file, it also automatically signs it, encrypts
it to the author as well, and generates the output in the text format
(ASCII armored), which is more universal than the binary format.
</p>

<p>
This simplicity makes it easier for the beginners to get started.
</p>

<p>
At the same time, the selected subset of operations and features
covers most of the common cases of usage, so hopefully it should be
sufficient for the everyday needs of most of the users.
</p>
</div>
</div>


<div id="outline-container-org6b300bb" class="outline-2">
<h2 id="org6b300bb">EGPG integrates seamlessly with GPG</h2>
<div class="outline-text-2" id="text-org6b300bb">
<p>
In case users need to use some advanced features or commands which are
not supported by EGPG, they can go on and use GPG itself at any time,
because EGPG also integrates seamlessly with GPG.
</p>

<p>
So, the reduced set of supported operations and features, while being
convenient for everyday usage, does not limit or prevent users for
doing more advanced or complex things.
</p>

<p>
For example, if you want to do some extra editing to the key, which
can't be done with EGPG due to its limited set of functionality, you
can do it like this:
</p>
<pre class="example">
egpg gpg --edit-key 562AC309C01D2DBD
</pre>
<p>
Running <code>gpg</code> as a subcommand of <code>egpg</code> will ensure that it uses the same
environment (<code>GNUPGHOME</code>) as <code>egpg</code>.
</p>

<p>
Also, when initiating a new EGPG environment (with <code>egpg init</code>), you can
migrate all the data from an existing GPG or EGPG environment (with
<code>egpg migrate</code>).
</p>

<p>
Or you can fetch (pick up) only certain keys or contacts (public
keys). For example:
</p>
<pre class="example">
egpg key fetch -k 01D532A283DC1CBF
egpg contact fetch 01D532A283DC1CBF
</pre>
</div>
</div>


<div id="outline-container-orgddda527" class="outline-2">
<h2 id="orgddda527">EGPG has a clear and intuitive terminology</h2>
<div class="outline-text-2" id="text-orgddda527">
<p>
One of the things that confuses people while using GPG is the
overloaded and unclear terminology about keys, about signatures, etc.
EGPG tries to improve this by making a clear distinction between the
private keys and the public keys.
</p>

<p>
In EGPG there is only one primary <b>key</b>, which is used for signing, and
a subkey which is used for decryption. All the public keys are called
<b>contacts</b>, since they contain the names and email addresses of the
people that you use to communicate (either send them encrypted
messages or verify their signatures).
</p>

<p>
If you say <b>public key</b> to a beginner, you will also have to explain to
him some cryptographic details and how public keys should be used.
But if you say <b>contact</b> everybody gets that it contains details that
enable and facilitate communication.
</p>

<p>
Also, it makes more sense when you certify and trust a contact, rather
than editing a key and changing its certification and trust levels.
</p>
</div>
</div>


<div id="outline-container-org70cd81b" class="outline-2">
<h2 id="org70cd81b">EGPG is transparent and auditable</h2>
<div class="outline-text-2" id="text-org70cd81b">
<p>
Being built as a set of shell scripts, EGPG is quite transparent and
auditable (different from a GUI for example, or a web service).  If
you are concerned about what it does, open up the files and read them,
or have someone you trust read them.
</p>

<p>
The size of the main script is less than 250 lines, well within the
reach of most of the users.  Most of the commands are implemented on
their own script, and these scripts are about 50 lines long on
average.
</p>
</div>
</div>


<div id="outline-container-org0b019e6" class="outline-2">
<h2 id="org0b019e6">EGPG commands</h2>
<div class="outline-text-2" id="text-org0b019e6">
<p>
The set of commands and options of EGPG is well structured and
intuitive.  There are commands for:
</p>
<ul class="org-ul">
<li>working with files (for signing and encryption)</li>
<li>managing the key</li>
<li>managing contacts</li>
<li>other extra commands</li>
</ul>

<p>
