easy-gnupg-talk/easy-gnupg.org
** EGPG file commands

  + The commands for working with files are these:
    #+begin_example
    egpg seal <file> [<recipient>...]
        Sign and encrypt a file. The resulting file will have the
        extension '.sealed'. The original file will be erased.

    egpg open <file.sealed>
        Decrypt and verify the signature of the given file.
        The file has to end with '.sealed' and the output will have
        that extension stripped.

    egpg sign <file>
        Sign a file. The signature will be saved to <file.signature>.

    egpg verify <file.signature>
        Verify the signature. The signed file must be present as well.
    #+end_example

** EGPG key commands

  + There are commands to:
    - generate a new key or fetch an existing one
    - to backup and restore the key
    - to split and join the key
    - to generate a revocation certificate
    - to revoke the key
    - to delete the key
    - etc.

** EGPG contact commands

  + The commands about contacts include:
    - commands to search and receive contacts from the keyserver
      network
    - to export and import from files
    - to fetch from existing GPG/EGPG directories
    - to certify and trust
    - etc.


* Managing the keys

  + To keep things simple, EGPG supports only one private key per
    directory.
  + But there are ways to use several keys if needed.  For example it
    can be done by using several EGPG directories/configurations,
    which can work in parallel and independently of each-other.

** Managing the keys

  + This is a design decision and is on purpose, not only for
    simplicity, but also because when you need more than one key, you
    usually use them in different contexts. So, it makes more sense to
    keep and manage them separately and independently of each-other,
    which could also help to avoid any confusion or mistakes when
    using them.


* EGPG extends the features of GPG

  + EGPG combines the features of GPG with external tools/commands in
    order to achieve better results or to be more user-friendly.

  + For example, when making the backup of the key, the output is
    produced as a _PDF file_ with a _2D barcode_, which can be printed on
    paper and stored away on a safe place. Later this can be easily
    scanned back to digital format and restored.

** EGPG extends the features of GPG

  + This is achieved by exporting the key from GPG in ASCII armor
    format, then using a bunch of Linux commands and tools, like
    *qrencode* and *convert*, to convert it to the proper PDF format.

  + There is nothing that cannot be done manually or with a shell
    script, but EGPG already automates things for you in a single
    command, so that you can immediately take advantage of best
    practices and recommendations.

** EGPG extends the features of GPG

  + Another example is printing the fingerprint of the key as a 2D
    barcode and picking it up from the camera.
  + This can simplify the exchange of keys in mobile phones, if people
    have physical contact.
  + For example in a meeting one of them can show the code on the
    screen, and the other one can scan it from the camera, and
    automatically fetch the details from a keyserver.
  + Or the fingerprint can be printed as a 2D barcode on a business
    card, and scanned from there.

** EGPG extends the features of GPG

  + Yet another example is moving the main key (that is used for
    signing and certification) to a dongle (USB flash drive), for
    portability and security (the USB flash drive should be
    encrypted).
  + This is done with the external command:
    #+begin_example
    egpg key2dongle
    #+end_example

* Splitting the key

  + You can split a key into 3 partial keys, so that any 2 of them can
    be combined to recreate the original key (but a single one is not
    enough).
  + EGPG takes advantage of this to save a partial key on the local
    machine and another partial on a dongle (USB flash drive,
    removable device).
  + The third partial key is used as a backup, to recover the full key
    in case that the dongle or the computer is lost, and it can be
    stored for example on a cloud account.

** Splitting the key

  + Splitting the key into partial keys makes key management safer and
    more robust.
  + In case that you loose the dongle, the key is not deconspired,
    because a single partial key is not enough to reconstruct the full
    key.
  + The same goes for the backup partial key; you can store it on
    cloud and if somebody manages to get it, they still cannot get
    your key.
  + Similarly, if you loose the dongle or change the PC, you still can
    recover the key using the remaining partial key and the backup
    partial key.

** Splitting the key

  + EGPG manages all this with simple commands:
    #+begin_example
    egpg key split [-d,--dongle <dir>] [-b,--backup <dir>]
        Split the key into 3 partial keys and store one of them on the
        dongle (removable device, usb), keep the other one locally,
        and use the third one as a backup. Afterwards, whenever the
        key needs to be used, the dongle has to be present.

    egpg key join
        Join two partial keys into a full key and delete the partials.

    egpg key recover <backup-partial.key.xyz>
        Recover the key from the backup partial key and from the
        partial key of the home or the dongle. This is useful when
        either the dongle or the home partial key is lost.
    #+end_example


* EGPG can work on any platform

  + The file *platform.sh* contains a couple of functions that can be
    platform dependent.
  + The platform is detected automatically and these functions are
    overridden with the right implementation for the current platform.
  + So, EGPG is flexible enough to potentially work on any platform.
  + However, currently it has been tested only on Ubuntu and Debian.


* EGPG is customizable and extensible

  + If EGPG doesn't fit your workflow, you can adapt and extend it to
    fit your way of doing things.
  + You can also share your extensions with the others, in the form of
    external commands.

** EGPG is customizable and extensible

  + The file *$EGPG_DIR/customize.sh* can be used to redefine and
    customize some functions, without having to touch the code of the
    main script.
  + External command *example* can be overridden (or defined) by adding
    the file *$EGPG_DIR/cmd_example.sh*, which contains the function
    *cmd_example() { . . . }*.

** EGPG is customizable and extensible

  + For an external command the script will look:
    - first for *$EGPG_DIR/cmd_example.sh*
    - then for *$LIB/ext/$PLATFORM/cmd_command.sh*
    - and finally for *$LIB/ext/cmd_command.sh*
    The first that is found is loaded and used.
  + For commands about the key the name of the file must be
    *cmd_key_example.sh*
  + For commands about contacts it must be *cmd_contact_example.sh*


* EGPG enables scripting

  + I think that it is time to stop writting detailed tutorials with
    best practices on how to use GPG on certain situations.

  + Write instead scripts (in EGPG or some other framework) that
    automate these processes.

  + GPG itself does not facilitate writing such scripts and EGPG tries
    to improve this.


