easy-gnupg/index.html
EGPG file commands:
</p>
<pre class="example">
egpg seal &lt;file&gt; [&lt;recipient&gt;...]
    Sign and encrypt a file. The resulting file will have the
    extension '.sealed'. The original file will be erased.

egpg open &lt;file.sealed&gt;
    Decrypt and verify the signature of the given file.
    The file has to end with '.sealed' and the output will have
    that extension stripped.

egpg sign &lt;file&gt;
    Sign a file. The signature will be saved to &lt;file.signature&gt;.

egpg verify &lt;file.signature&gt;
    Verify the signature. The signed file must be present as well.
</pre>

<p>
The key commands include:
</p>
<ul class="org-ul">
<li>generate a new key or fetch an existing one</li>
<li>to backup and restore the key</li>
<li>to split and join the key</li>
<li>to generate a revocation certificate</li>
<li>to revoke the key</li>
<li>to delete the key</li>
</ul>

<p>
The commands about contacts include:
</p>
<ul class="org-ul">
<li>commands to search and receive contacts from the keyserver
network</li>
<li>to export and import from files</li>
<li>to fetch from existing GPG/EGPG directories</li>
<li>to certify and trust</li>
</ul>
</div>
</div>


<div id="outline-container-orgb8feb3c" class="outline-2">
<h2 id="orgb8feb3c">Managing the keys</h2>
<div class="outline-text-2" id="text-orgb8feb3c">
<p>
To keep things simple, EGPG supports only one private key per
directory.
</p>

<p>
But there are ways to use several keys if needed.  For example it can
be done by using several EGPG directories/configurations, which can
work in parallel and independently of each-other.
</p>

<p>
This is a design decision and is on purpose, not only for simplicity,
but also because when you need more than one key, you usually use them
in different contexts. So, it makes more sense to keep and manage them
separately and independently of each-other, which could also help to
avoid any confusion or mistakes when using them.
</p>
</div>
</div>


<div id="outline-container-orge4031cc" class="outline-2">
<h2 id="orge4031cc">EGPG extends the features of GPG</h2>
<div class="outline-text-2" id="text-orge4031cc">
<p>
EGPG combines the features of GPG with external tools/commands in
order to achieve better results or to be more user-friendly.
</p>

<p>
For example, when making the backup of the key, the output is produced
as a <span class="underline">PDF file</span> with a <span class="underline">2D barcode</span>, which can be printed on paper and
stored away on a safe place. Later this can be easily scanned back to
digital format and restored.
</p>

<p>
This is achieved by exporting the key from GPG in ASCII armor format,
then using a bunch of Linux commands and tools, like <b>qrencode</b> and
<b>convert</b>, to convert it to the proper PDF format.
</p>

<p>
There is nothing that cannot be done manually or with a shell script,
but EGPG already automates things for you in a single command, so that
you can immediately take advantage of best practices and
recommendations.
</p>

<p>
Another example is printing the fingerprint of the key as a 2D barcode
and picking it up from the camera.  This can simplify the exchange of
keys in mobile phones, if people have physical contact.
</p>

<p>
For example in a meeting one of them can show the code on the screen,
and the other one can scan it from the camera, and automatically fetch
the details from a keyserver. Or the fingerprint can be printed as a
2D barcode on a business card, and scanned from there.
</p>

<p>
Yet another example is moving the main key (that is used for signing
and certification) to a dongle (USB flash drive), for portability and
security (the USB flash drive should be encrypted).  This is done with
the external command:
</p>
<pre class="example">
egpg key2dongle
</pre>
</div>
</div>


<div id="outline-container-orgec3dfed" class="outline-2">
<h2 id="orgec3dfed">Splitting the key</h2>
<div class="outline-text-2" id="text-orgec3dfed">
<p>
You can split a key into 3 partial keys, so that any 2 of them can be
combined to recreate the original key (but a single one is not
enough).
</p>

<p>
EGPG takes advantage of this to save a partial key on the local
machine and another partial on a dongle (USB flash drive, removable
device). The third partial key is used as a backup, to recover the
full key in case that the dongle or the computer is lost, and it can
be stored for example on a cloud account.
</p>

<p>
Splitting the key into partial keys makes key management safer and
more robust. In case that you loose the dongle, the key is not
deconspired, because a single partial key is not enough to reconstruct
the full key.
</p>

<p>
The same goes for the backup partial key; you can store it on cloud
and if somebody manages to get it, they still cannot get your key.
</p>

<p>
Similarly, if you loose the dongle or change the PC, you still can
recover the key using the remaining partial key and the backup partial
key.
</p>

<p>
EGPG manages all this with simple commands:
</p>
<pre class="example">
egpg key split [-d,--dongle &lt;dir&gt;] [-b,--backup &lt;dir&gt;]
    Split the key into 3 partial keys and store one of them on the
    dongle (removable device, usb), keep the other one locally,
    and use the third one as a backup. Afterwards, whenever the
    key needs to be used, the dongle has to be present.

egpg key join
    Join two partial keys into a full key and delete the partials.

egpg key recover &lt;backup-partial.key.xyz&gt;
    Recover the key from the backup partial key and from the
    partial key of the home or the dongle. This is useful when
    either the dongle or the home partial key is lost.
</pre>
</div>
</div>


<div id="outline-container-org59cf601" class="outline-2">
<h2 id="org59cf601">EGPG can work on any platform</h2>
<div class="outline-text-2" id="text-org59cf601">
<p>
The file <b>platform.sh</b> contains a couple of functions that can be
platform dependent. The platform is detected automatically and these
functions are overridden with the right implementation for the current
platform.
</p>

<p>
So, EGPG is flexible enough to potentially work on any platform.
However, currently it has been tested only on Ubuntu and Debian.
</p>
</div>
</div>


<div id="outline-container-org99f0ccb" class="outline-2">
<h2 id="org99f0ccb">EGPG is customizable and extensible</h2>
<div class="outline-text-2" id="text-org99f0ccb">
<p>
If EGPG doesn't fit your workflow, you can adapt and extend it to fit
your way of doing things.  You can also share your extensions with the
others, in the form of external commands.
</p>

<p>
The file <b>$EGPG_DIR/customize.sh</b> can be used to redefine and customize
some functions, without having to touch the code of the main script.
</p>

<p>
External command <b>example</b> can be overridden (or defined) by adding the
file <b>$EGPG_DIR/cmd_example.sh</b>, which contains the function
<b>cmd_example() { . . . }</b>. For an external command the script will look:
</p>
<ul class="org-ul">
<li>first for <b>$EGPG_DIR/cmd_example.sh</b></li>
<li>then for <b>$LIB/ext/$PLATFORM/cmd_command.sh</b></li>
<li>and finally for <b>$LIB/ext/cmd_command.sh</b></li>
</ul>

<p>
The first that is found is loaded and used. For commands about the
key the name of the file must be <b>cmd_key_example.sh</b> For commands about
contacts it must be <b>cmd_contact_example.sh</b>
</p>
</div>
</div>


<div id="outline-container-orgefd5e15" class="outline-2">
<h2 id="orgefd5e15">EGPG enables scripting</h2>
<div class="outline-text-2" id="text-orgefd5e15">
<p>
I think that it is time to stop writting detailed tutorials with best
practices on how to use GPG on certain situations.  Write instead
scripts (in EGPG or some other framework) that automate these
processes.
</p>

<p>
GPG itself does not facilitate writing such scripts and EGPG tries to
improve this.
</p>
</div>
</div>
