easy-gnupg-talk/easy-gnupg.org
* EGPG criticism

  + The EGPG critics have expressed their concerns that since EGPG is
    just a wrapper script to GPG, it is too fragile.
  + This is so because the GPG command line was meant to be an
    interactive tool, not a streamline tool that can be easily
    combined with other tools.
  + As such, its output format can change at any time, and even small
    changes can break EGPG.

** EGPG criticism

  + A possible defense argument can be that EGPG should be used only
    with stable releases of Linux distributions, which by definition
    don't change the major versions of their supported tools and
    utilities and allow only for bug and security fixes.
  + So, the chances of EGPG being broken are small, and it needs to be
    updated/fixed only for every next stable release (which does not
    occur too frequently).

  + Nevertheless the problem still exists and the recommended solution
    is to re-implement parts of EGPG with Python bindings of GPGME
    (which is a library for doing GPG stuff).


* EGPG improvements

  + There is a proposed project on GSoC about possible improvements to
    EGPG: https://wiki.debian.org/SummerOfCode2018/Projects/EasyGnuPG

  + I am looking for co-mentors, and of course for interested
    students.

** EGPG improvements

  + Some of the potential improvements are:
    - Rewrite EasyGnuPG (or parts of it) so that it is built with
      Python and GPGME (https://www.gnupg.org/software/gpgme/)
    - Implement a GUI to EasyGnuPG (maybe with Python).
    - Extend EasyGnuPG with scripts/commands that automate other
      common usage scenarios (for example keeping the master key on a
      card).
    - Make a Debian package for installing EasyGnuPG.

* Thank you for your attention

  + Any questions or comments?
    - dashohoxha@gmail.com

  + Links:
    - https://github.com/dashohoxha/egpg
    - https://wiki.debian.org/SummerOfCode2018/Projects/EasyGnuPG

#  LocalWords:  Dashamir Hoxha
