easy-gnupg/index.html


<div id="outline-container-orgcb61e78" class="outline-2">
<h2 id="orgcb61e78">EGPG criticism</h2>
<div class="outline-text-2" id="text-orgcb61e78">
<p>
The EGPG critics have expressed their concerns that since EGPG is just
a wrapper script to GPG, it is too fragile.  This is so because the
GPG command line was meant to be an interactive tool, not a streamline
tool that can be easily combined with other tools.  As such, its
output format can change at any time, and even small changes can break
EGPG.
</p>

<p>
A possible defense argument can be that EGPG should be used only with
stable releases of Linux distributions, which by definition don't
change the major versions of their supported tools and utilities and
allow only for bug and security fixes.  So, the chances of EGPG being
broken are small, and it needs to be updated/fixed only for every next
stable release (which does not occur too frequently).
</p>

<p>
Nevertheless the problem still exists and the recommended solution is
to re-implement parts of EGPG with Python bindings of GPGME (which is
a library for doing GPG stuff).
</p>
</div>
</div>


<div id="outline-container-org59d14a4" class="outline-2">
<h2 id="org59d14a4">EGPG improvements</h2>
<div class="outline-text-2" id="text-org59d14a4">
<p>
There is a proposed project on GSoC about possible improvements to
EGPG: <a href="https://wiki.debian.org/SummerOfCode2018/Projects/EasyGnuPG">https://wiki.debian.org/SummerOfCode2018/Projects/EasyGnuPG</a> I am
looking for co-mentors, and of course for interested students.
</p>

<p>
Some of the potential improvements are:
</p>
<ul class="org-ul">
<li>Rewrite EasyGnuPG (or parts of it) so that it is built with Python
and GPGME (<a href="https://www.gnupg.org/software/gpgme/">https://www.gnupg.org/software/gpgme/</a>)</li>
<li>Implement a GUI to EasyGnuPG (maybe with Python).</li>
<li>Extend EasyGnuPG with scripts/commands that automate other common
usage scenarios (for example keeping the master key on a card).</li>
<li>Make a Debian package for installing EasyGnuPG.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Dashamir Hoxha</p>
<p class="date">Created: 2018-02-03 Sat 17:31</p>
<p class="validation"></p>
</div>
</body>
</html>
